Siraasaka/SSI-TLS-ESP32/wolfssl/examples/baseline_client_mutual/baseline_client_mutual.ino
            cipherName = wolfSSL_get_cipher(ssl);
            Serial.print(F("SSL cipher suite is "));
            Serial.println(cipherName);

            /* === BENCHMARK SSI-TLS BASELINE === */
            Serial.print(F("[BM] Handshake: "));
            Serial.print(_hs_ms);
            Serial.println(F(" ms"));
            {
                static int    _n   = 0;
                static unsigned long _sum = 0;
                static unsigned long _min = 0xFFFFFFFFUL;
                static unsigned long _max = 0;
                const int BM_ROUNDS = 150;
                static unsigned long _times[150]; /* store all times */
                if (_n < BM_ROUNDS) {
                    _sum += _hs_ms;
                    if (_hs_ms < _min) _min = _hs_ms;
                    if (_hs_ms > _max) _max = _hs_ms;
                    _times[_n] = _hs_ms;
                    _n++;
                    Serial.print(_n);
                    Serial.print(F(","));
                    Serial.println(_hs_ms);
                }
                if (_n == BM_ROUNDS) {
                    float mean = (float)_sum / BM_ROUNDS;
                    float var = 0;
                    for(int _i=0;_i<BM_ROUNDS;_i++){
                        float d=(float)_times[_i]-mean; var+=d*d;
                    }
                    float sd = sqrt(var/BM_ROUNDS);
                    Serial.println(F(""));
                    Serial.println(F("=== HASIL BENCHMARK BASELINE mTLS 1.3 ==="));
                    Serial.print(F("Rounds  : ")); Serial.println(BM_ROUNDS);
                    Serial.print(F("Mean    : ")); Serial.print(mean,1); Serial.println(F(" ms"));
                    Serial.print(F("Min     : ")); Serial.print(_min); Serial.println(F(" ms"));
                    Serial.print(F("Max     : ")); Serial.print(_max); Serial.println(F(" ms"));
                    Serial.print(F("StdDev  : ")); Serial.print(sd,1); Serial.println(F(" ms"));
                    Serial.println(F("========================================="));
                    Serial.println(F("[BM] Benchmark selesai. Halting."));
                    _n++;
                    g_repeat = false;
                    /* Hard halt */
                    while(1) { delay(10000); }
                }
            }
            /* === END BENCHMARK === */

            /* see test.h
             * TODO: test.h needs a little bit of Arduino work for these:
            showPeerEx(ssl, lng_index);
            showPeerPEM(ssl);
            */

            Serial.print(F("Sending secure message to server: "));
            Serial.println(msg);
            ret = wolfSSL_write(ssl, msg, msgSz);
            if (ret == msgSz) {
                Serial.print(F("Waiting for Server response..."));

                while (!client.available()) {
                    /* wait for data */
                    delay(1); /* 1 ms delay */
                }

                Serial.print(F("Reading response.."));
                /* read data */
                do {
                    ret = wolfSSL_read(ssl, reply, sizeof(reply) - 1);
                    if (ret < 0) {
                        error_check_ssl(ssl, ret, false,
                                        F("during TLS Read"));
                    }
                    else {
                        Serial.print(PROGRESS_DOT);
                    }
                } while (err == WC_PENDING_E);
                Serial.println();

                Serial.println();
                Serial.println(reply); /* typically: I hear you fa shizzle! */
                Serial.println();

            } /* wolfSSL_write message size matched */
            else {
                error_check_ssl(ssl, ret, false,
                    F("during TLS Write"));
            }  /* any wolfSSL_write message size mismatch is an error */

            Serial.print(F("Shutting down.."));
            do {
                delay(1);
                Serial.print(PROGRESS_DOT);
                retry_shutdown--;
                ret = wolfSSL_shutdown(ssl);
            } while (   (ret == WOLFSSL_SHUTDOWN_NOT_DONE)
                     && (retry_shutdown > 0)
                    ); /* There may be pending data, so wait until done. */
            Serial.println();

            if (retry_shutdown <= 0) {
                /* if wolfSSL_free is called before properly shutting down the
                 * ssl object, undesired results may occur. */
                Serial.println(F("Warning! Shutdown did not properly complete."));
            }

            wolfSSL_free(ssl);
            client.stop();
            Serial.println(F("Connection complete."));
            if (REPEAT_CONNECTION && g_repeat) {
                reconnect = RECONNECT_ATTEMPTS;
            }
            else {
                reconnect = 0;
            }
        } /* client.connect(host, port) */
        else {
            Serial.println(F("Problem sending message. Trying to reconnect..."));
        }
    }
    delay(1000);
    if ((reconnect > 0) && (REPEAT_CONNECTION) && g_repeat) {
        Serial.println(F("Arduino loop repeating..."));
        Serial.println();
    }
    else {
        printf("wow");
        Serial.println(F("Done!"));
        while(1) {
            /* wait forever */
        }
    }

#if defined(MEMORY_STRESS_TEST)
    if (mem_ctr < MEMORY_STRESS_ITERATIONS) {
        /* reminder: mem_ctr == 0 is MEMORY_STRESS_INITIAL allocation */
        mem_ctr++;
        Serial.print(F("Memory stress increment: "));
        Serial.print(mem_ctr);
        Serial.print(F(". Allocating addition memory (bytes): "));
        Serial.println(MEMORY_STRESS_BLOCK_SIZE);
        memory_stress[mem_ctr] = (char*)malloc(MEMORY_STRESS_BLOCK_SIZE);
        show_memory();
    }
#endif
} /* Arduino loop repeats */
